---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerReferenceLabel
source: html/adf8f953-1fb7-4da9-f131-cf578aa84efc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerReferenceLabel Property

"Reference Label"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerReferenceLabel { get; }
```